#+TITLE: Car2Go Tables

#+LATEX_CLASS_OPTIONS: [a4paper, 12pt]
#+LATEX_HEADER: \usepackage[left=2.5cm, right=2.5cm, top=2.5cm, bottom=2.5cm, bindingoffset=1.5cm, head=15pt]{geometry}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \onehalfspacing
#+OPTIONS: H:4

#+CAPTION: Raw Car2Go Data in Stuttgart label:data-car2go-raw

#+ATTR_LATEX: :float sideways :align c|ccccccc
|--------------+------------------+----------+-----------+---------------------+----------+----------+---------|
|--------------+------------------+----------+-----------+---------------------+----------+----------+---------|
| Number Plate | Timestamp        | Latitude | Longitude | Street              | Zip Code | Charging | SoC (%) |
|--------------+------------------+----------+-----------+---------------------+----------+----------+---------|
| S-GO2471     | 24.12.2017 20:00 |  9.19121 |  48.68895 | Parkplatz Flughafen |    70692 | no       |      94 |
| S-GO2471     | ...              |      ... |       ... | ...                 |      ... | ....     |     ... |
| S-GO2471     | 24.12.2017 20:05 |  9.19121 |  48.68895 | Parkplatz Flughafen |    70692 | no       |      94 |
| S-GO2471     | 24.12.2017 20:10 |  9.19121 |  48.68895 | Parkplatz Flughafen |    70692 | no       |      94 |
| S-GO2471     | 24.12.2017 23:05 |  9.15922 |  48.78848 | Salzmannweg 3       |    70192 | no       |      71 |
| S-GO2471     | 24.12.2017 23:10 |  9.15922 |  48.78848 | Salzmannweg 3       |    70192 | no       |      71 |
| S-GO2471     | 25.12.2017 00:40 |  9.17496 |  48.74928 | Felix-Dahn-Str.45   |    70597 | yes      |      62 |
| S-GO2471     | 25.12.2017 00:45 |  9.17496 |  48.74928 | Felix-Dahn-Str.45   |    70597 | yes      |      64 |
| S-GO2471     | ...              |      ... |       ... | ...                 |      ... | ....     |     ... |
| S-GO2471     | 25.12.2017 06:50 |  9.17496 |  48.74928 | Felix-Dahn-Str.45   |    70597 | no       |     100 |
| S-GO2471     | 25.12.2017 08:25 |   9.2167 |  48.78742 | Friedenaustraße 25  |    70188 | no       |      42 |
|--------------+------------------+----------+-----------+---------------------+----------+----------+---------|
|--------------+------------------+----------+-----------+---------------------+----------+----------+---------|


#+CAPTION: Processed Car2Go Trip Data in Stuttgart label:data-car2go-processed
#+ATTR_LATEX: :float sideways :align cc|ccccc
#+TBLNAME: car2go-table
|--------------+------+---------------------+--------------------+-----------------+---------------|
|--------------+------+---------------------+--------------------+-----------------+---------------|
| Number Plate | Trip | Start Time          |     Start Latitude | Start Longitude | Start SoC (%) |
|--------------+------+---------------------+--------------------+-----------------+---------------|
| S-GO2471     |    1 | 24.12.2017 20:10    |            9.19121 |        48.68895 |            94 |
| S-GO2471     |    2 | 24.12.2017 23:10    |            9.15922 |        48.78848 |            71 |
| S-GO2471     |    3 | 25.12.2017 06:50    |            9.17496 |        48.74928 |            66 |
|--------------+------+---------------------+--------------------+-----------------+---------------|
| Number Plate | Trip | End Time            |       End Latitude |   End Longitude |   End SoC (%) |
|--------------+------+---------------------+--------------------+-----------------+---------------|
| S-GO2471     |    1 | 24.12.2017 23:05    |            9.15922 |        48.78848 |            71 |
| S-GO2471     |    2 | 25.12.2017 00:40    |            9.17496 |        48.74928 |            62 |
| S-GO2471     |    3 | 25.12.2017 08:25    |             9.2167 |        48.78742 |            42 |
|--------------+------+---------------------+--------------------+-----------------+---------------|
| Number Plate | Trip | Trip Duration (min) | Trip Distance (km) | Trip Charge (%) |  End Charging |
|--------------+------+---------------------+--------------------+-----------------+---------------|
| S-GO2471     |    1 | 175                 |              33.35 |              23 |            no |
| S-GO2471     |    2 | 90                  |              13.05 |               9 |           yes |
| S-GO2471     |    3 | 155                 |                 29 |              20 |            no |
|--------------+------+---------------------+--------------------+-----------------+---------------|
|--------------+------+---------------------+--------------------+-----------------+---------------|

# NOTE: Calculations for table fields
#+BEGIN_SRC python :results output :exports none :var t1=-3 t2=-2 t3=-1 data=car2go-table

EV_RANGE = 145
CHARGE_POS = 4

def distance(trip_charge):
    return round((trip_charge / 100) * EV_RANGE, 2)


d1 = distance(data[t1][CHARGE_POS])
d2 = distance(data[t2][CHARGE_POS])
d3 = distance(data[t3][CHARGE_POS])
print(d1, d2, d3)
#+END_SRC

#+RESULTS:
: 33.35 13.05 29.0
